advanced-0721/common/models/NklActivityInfoQuery.php

SELECT * FROM `nkl_activity_info` WHERE `activity_id`='1'
---
    public function one($db = null)
    {
        return parent::one($db);