advanced-0721/frontend/views/site/index.php

			<hr style="margin:10px 0 10px 0">
			<div class="row" frag="面板19" style="padding-left:15px;padding-right:15px;padding-bottom:30px;">
				<div class="col-md-12" frag="窗口19" portletmode="simpleList">
					<!-- List -->
					<?php $NklNewsInfos = NklNewsInfo::find()->orderBy('news_releaseTime DESC')->limit(5)->all(); ?>
---
SELECT * FROM `nkl_news_info` ORDER BY `news_releaseTime` DESC LIMIT 5