advanced/frontend/views/site/index.php

SELECT * FROM `nkl_news_info` ORDER BY `news_releaseTime` DESC LIMIT 5
---
			<hr style="margin:10px 0 10px 0">
			<div class="row" frag="面板19" style="padding-left:15px;padding-right:15px;padding-bottom:30px;">
				<div class="col-md-12" frag="窗口19" portletmode="simpleList">
					<!-- List -->
					<?php $NklNewsInfos = NklNewsInfo::find()->orderBy('news_releaseTime DESC')->limit(5)->all(); ?>

SELECT * FROM `nkl_bbs_info` ORDER BY `bbs_time`, `bbs_id` DESC LIMIT 3
---
			<div class="timeline-left" frag="窗口11101">
				<table width="100%" border="0" cellspacing="0" cellpadding="0" class="wp_article_list_table">
					<tbody>
						<?php $NklBbsInfos = NklBbsInfo::find()->orderBy('bbs_time,bbs_id DESC')->limit(3)->all(); ?>