advanced/frontend/views/site/news.php

            <div class="row" frag="面板19" style="padding-left:15px;padding-right:15px;padding-bottom:30px;">
                <div class="col-md-12" frag="窗口19" portletmode="simpleList">
<<<<<<< HEAD
                    <?php $NklNewsInfos = NklNewsInfo::find()->orderBy('news_releaseTime DESC')->all(); ?>
                    <?php $count = NklNewsInfo::find()->count(); $pagination = new Pagination(['totalCount' => $count,'pageSize' => 15]);
                                 $articles = NklNewsInfo::find()->offset($pagination->offset)->limit($pagination->limit)->all();?>
                    <?php foreach ($articles as $NklNewsInfo) : ?>
=======
                    <?php $NklNewsInfos = NklNewsInfo::find()->where(['news_isSelected' => 1])->orderBy('news_releaseTime DESC')->all(); ?>
---
SELECT * FROM `nkl_news_info` ORDER BY `news_releaseTime` DESC
SELECT * FROM `nkl_news_info` LIMIT 15
SELECT COUNT(*) FROM `nkl_news_info`
SELECT * FROM `nkl_news_info` WHERE `news_isSelected`=1 ORDER BY `news_releaseTime` DESC