advanced-0721/frontend/controllers/NklActivityInfoController.php

INSERT INTO `nkl_activity_info` (`activity_info`, `activity_location`, `activity_beginDate`, `activity_beginTime`, `activity_endDate`, `activity_endTime`, `activity_hostDept`) VALUES ('hellp', 'nankaidaxue ', '2019-4-1', '12:00', '2019-4-1', '19:00', 'balitai')
---
    public function actionCreate()
    {
        $model = new NklActivityInfo();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {