advanced/frontend/controllers/SiteController.php

INSERT INTO `nkl_bbs_info` (`bbs_userNickname`, `bbs_userDescribe`, `bbs_content`) VALUES ('李伟', '2017年经济管理贵州南开校友会', '祝南开越来越好<img src=\"http://img.t.sinajs.cn/t4/appstyle/expression/ext/normal/f6/2018new_aini_org.png\" height=\"22\" width=\"22\" />')
---
    public function actionBbs()
    {
        $model = new NklBbsInfo();

	    if ($model->load(Yii::$app->request->post()) && $model->save()) {