advanced/frontend/views/nklproductsinfo/payment.php

		      <?php
     $num = $result['product_storage'];
     $num = $num - 1;
     Yii::$app->db->createCommand()->update('nkl_products_info', ['product_storage' => $num])->execute();
	$userid = Yii::$app->session->get('admin')['adminuser'];
    $nowtime = date('Y-m-d H:i:s',time());
    $res = Yii::$app->db->createCommand()->insert('nkl_purchase_record', [
    'user_id' => '12345',
    'product_id' => $result['product_id'],
    'purchase_time' => $nowtime,
])->execute();
---
UPDATE `nkl_products_info` SET `product_storage`=46
INSERT INTO `nkl_purchase_record` (`user_id`, `product_id`, `purchase_time`) VALUES (12345, 3, '2019-07-22 18:00:22')